<template>
  <div>
    <h2>Приемка дежурства</h2>
    <div v-for="item in acceptance" :key="item.name">
      <h3>{{ item.name }}</h3>
      <p>{{ item.body }}</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AppAcceptance',
  data () {
    return {
      acceptance: [
        {
          name: 'Пожарный №1',
          body:
          'Принимает пожарные стволы, диэлектрику(перчатки, коврик, боты, ножницы), переносные заземлители'
        },
        {
          name: 'Пожарный №2',
          body: 'Принимает напорные рукава, рукавные зажимы и задержки. Принимает лестницы, ТОКи и ручной немеханизированный инструмент(ломы, багры, лопаты, топоры, пилы, крюк)'
        },
        {
          name: 'Пожарный №3',
          body: 'Принимает всасывающие и напорно-всасывающие рукава, всасывающую сетку, водосборник, 4-х метровые напорные рукава, переходные головки, пожарную колонку, крюк для открывания ПГ, ключи для соединения рукавов, рукавные мостики.'
        }
      ]
    }
  }
}

</script>

<style scoped>
p {
  text-align:left;
  line-height: 1.5em;
}
</style>
