<template>
  <div>
    <h2>Документы</h2>
    <div v-for="decree in decrees" :key="decree.name" class="divblock">
      <h4>{{ decree.numAndDate }}</h4>
      <p>
        <strong>{{ decree.name }}</strong> {{ decree.body }}
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AppInformation',
  data () {
    return {
      decrees: [
        {
          numAndDate: '№ 777 от 16.09.2024',
          name: 'Боевой устав',
          body: 'подразделений пожарной охраны определяющий порядок организации тушения пожаров и проведения АСР'
        },
        {
          numAndDate: '№ 881н от 23.12.2014',
          name: 'Правила по Охране Труда',
          body: 'в подразделениях федеральной противопожарной службы'
        },
        {
          numAndDate: '№ 387 от 25.05.2018',
          name: 'Инструкция по содержанию и эксплуатации пожарных рукавов',
          body: ''
        },
        {
          numAndDate: '№ 452 от 20.10.2010',
          name: 'Устав подраздений пожарной охраны',
          body: ''
        },
        {
          numAndDate: '№ 640 от 27.06.2022',
          name: 'ГДЗС.',
          body: 'Правила использования средств индивидуальный защиты органов дыхания и зрения личного состава подразделений пожарной охраны'
        },
        {
          numAndDate: '№ 220-н от 03.05.2024',
          name: 'Об утверждении порядка оказания первой помощи',
          body: ''
        },
        {
          numAndDate: '№ 1029 от 31.01.2018',
          name: 'Наставление по физической подготовке',
          body: 'работников ГПС Мурманской области'
        },
        {
          numAndDate: '№ 471 от 26.06.2018',
          name: 'Нормативы по ПСП и тактико-специальной подготовке',
          body: 'для работников ГПС Мурманской области'
        },
        {
          numAndDate: '№ 750 от 28.12.2015',
          name: 'Положение о диспетчерской службе',
          body: ''
        },
        {
          numAndDate: '№ 69 от 21.12.1994',
          name: 'Закон Мурманской области о пожарной безопасности',
          body: ''
        },
        {
          numAndDate: '№ 467 от 25.10.2017',
          name: 'Положение о пожарно спасательных гарнизонах',
          body: ''
        },
        {
          numAndDate: '№ 700 от 30.06.2000',
          name: 'Наставление по Службе связи',
          body: ''
        },
        {
          numAndDate: '№ 759 от 30.12.2015',
          name: 'Положение по Технической службе',
          body: ''
        },
        {
          numAndDate: '№ 1094 от 13.09.1996',
          name: 'О классификации чрезвычайных ситуаций природного и техногенного характера',
          body: ''
        },
        {
          numAndDate: '№ 123 от 22.07.2008',
          name: 'Технический регламент от требованиях пожарной безопасности',
          body: ''
        }
      ]
    }
  }
}
</script>

<style scoped>
.divblock {
  margin-top: 40px;
}
p {
  text-align: left;
  line-height: 1.5em;
}
</style>
