<template>
  <div>
    <h2>Обязанности</h2>
    <div v-for="resp in responsibilities" :key="resp.name">
      <h3>{{ resp.name }}</h3>
      <ul>
        <li v-for="el in resp.body" :key="el">
          <p class="space">{{ el }}</p>
        </li>
      </ul>
    </div>
    <p class="thanks">
      Спасибо товарищу Борейко, что не забывает напоминать о том, что
      обязанности обновились
    </p>
  </div>
</template>

<script>
export default {
  // name: 'AppRespon',
  data () {
    return {
      responsibilities: [
        {
          name: 'Обязанности пожарного',
          body: [
            'Выезжать к месту пожара с целью его тушения и проведения аварийно-спасательных работ.',
            'Принимать закрепленное пожарно-техническое вооружение при заступлении на дежурство.',
            'Проводить техническое обслуживание закрепленного СИЗОД',
            'Обеспечивать выполнение обязанностей пожарного при несении службы на постах, в дозорах и во внутреннем наряде',
            'Совершенствовать свою профессиональную подготовку',
            'Соблюдать правила охраны труда, пожарной безопасности и санитарно-гигиенические нормы в период боевого дежурства',
            'Беречь имущество подразделения, содержать в чистоте и постоянной готовности закрепленное пожарно-техническое вооружение',
            'Знать обстановку в районе (подрайоне) выезда подразделения',
            'Вносить предложения командиру отделения по улучшению условий несения караульной службы'
          ]
        },
        {
          name: 'Обязанности газодымозащитника',
          body: [
            'Подчиняться командиру звена ГДЗС, знать задачу звена и выполнять её',
            'Соблюдать правила по охране труда и требования Правил по работе в СИЗОД',
            'Не оставлять звено до выхода из непригодной для дыхания среды',
            'Запоминать маршрут движения звена ГДЗС, следить за изменением обстановки, за состоянием строительных конструкций и распространением огня во время движения, и на месте проведения работ',
            'Следить за давлением воздуха в баллоне',
            'Знать контрольное давление выхода',
            'Не пользоваться без необходимости байпасом',
            'Включаться и выключаться из СИЗОД только по команде командира звена',
            'Докладывать командиру звена ГДЗС об изменении обстановки, обнаруженных неисправностях в СИЗОД или появлении плохого самочувствия и действовать по его указанию',
            'Знать сигналы оповещения об опасности, установленные на месте пожара(аварии)',
            'Знать и контролировать допустимое время работы в зоне с НДС, заражения АХОВ и загрязнения радиоактивными веществами',
            'Не допускать снятия лицевой части маски или её оттягивания для протирки стекла, даже на короткое время',
            'Не заходить без уточнения значений концентрации паров АХОВ или уровня радиационного заражения в аварийные помещения',
            'Знать место расположения поста безопасности ГДЗС',
            'Использовать СИЗОД в соответствии с требованиями руководства по эксплуатации организации-изготовителя',
            'При срабатывании сигнального устройства незамедлительно доложить командиру звена ГДЗС и выйти в составе звена ГДЗС на свежий воздух',
            'В случаях обнаружения неисправности ДАСВ доложить командиру звена ГДЗС и действовать по его указанию'
          ]
        },
        {
          name: 'Обязанности постового у фасада',
          body: [
            'Знать и соблюдать порядок допуска личного состава подразделения, граждан и транспортных средств на территорию подразделения',
            'Принимать от граждан заявления о пожарах и авариях и докладывать о них начальнику караула',
            'Вести постоянное наблюдение за обстановкой в пределах видимости, при обнаружении пожара, аварии сообщать начальнику караула',
            'Не допускать остановки и стоянки любых видов транспорта перед воротами гаража и перед въездом на территорию части',
            'Следить за чистотой и порядком у фасада здания подразделения',
            'Выяснять цель прибытия у всех лиц, прибывающих в подразделение, после чего, используя сигнал вызова должностных лиц караула, вызывать начальника караула, а во время его отсутствия – дежурного'
          ]
        },
        {
          name: 'Обязанности постового на посту безопасности ГДЗС',
          body: [
            'Уметь проводить расчеты запаса воздуха и времени работы звена ГДЗС в СИЗОД',
            'Вести журнал учета времени пребывания звеньев ГДЗС в НДС',
            'Перед входом звена ГДЗС в НДС:',
            'Контролировать закрепление путевого троса на месте расположения поста безопасности ГДЗС',
            'Заносить показания манометров СИЗОД в журнал учета работающих звеньев, определив из них наименьший показатель давления воздуха для последующих расчетов времени работы звена ГДЗС',
            'Рассчитать и сообщить звену ГДЗС давление, которое они могут максимально израсходовать при следовании к очагу пожара и на месте работы',
            'Рассчитать и сообщить давление, при котором звену ГДЗС необходимо начинать возвращаться из НДС',
            'Рассчитать промежуток времени с момента включения в СИЗОД до подачи команды на возвращение звена ГДЗС из НДС',
            'Рассчитать время подачи команды на возвращение звена ГДЗС из НДС и при наступлении его подать такую команду',
            'Рассчитать общее примерно время работы звена ГДЗС в НДС',
            'Рассчитать время, при котором звено ГДЗС в обязательном порядке должно вернуться из НДС',
            'При работе звена ГДЗС в НДС:',
            'Знать информацию о местонахождении звена, об условии его работы и времени его возвращения',
            'Контролировать по рации значения воздуха в баллонах СИЗОД звена ГДЗС и значения времени работы',
            'Каждые 10 минут, а при необходимости чаще, информировать командира звена о времени, прошедшем с момента включения в СИЗОД',
            'Вести наблюдение за обстановкой на месте пожара(аварии) и анализировать получаемую информацию от командира звена ГДЗС, о случае возникновения опасности сообщить командиру звена ГДЗС',
            'В случае потери связи со звеном, при несчастном случае, задержки возвращения звена и возникновения угрожающих звену ГДЗС опасноснях сообщать РТП, начальникам КПП ГДЗС и БУ и действовать по их указанию'
          ]
        }
      ]
    }
  }
}
</script>

<style scoped>
h3 {
  padding-top: 1em;
}
ul {
  margin-left: -25px;
}
p {
  text-align: left;
  line-height: 1.5em;
}
.space {
  white-space: pre-line;
}
.thanks {
  font-size: 10px;
}
</style>
