<template>
  <div>
    <h2>Обязанности</h2>
    <div v-for="resp in responsibilities" :key="resp.name">
      <h3>{{ resp.name }}</h3>
      <ul>
        <li v-for="el in resp.body" :key="el">
          <p class="space">{{ el }}</p>
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  // name: 'AppRespon',
  data () {
    return {
      responsibilities: [
        {
          name: 'Обязанности пожарного',
          body: [
            'Выезжать к месту пожара с целью его тушения и проведения аварийно-спасательных работ.',
            'Принимать закрепленное пожарно-техническое вооружение при заступлении на дежурство.',
            'Проводить техническое обслуживание закрепленного СИЗОД',
            'Обеспечивать выполнение обязанностей пожарного при несении службы на постах, в дозорах и во внутреннем наряде',
            'Совершенствовать свою профессиональную подготовку',
            'Соблюдать правила охраны труда, пожарной безопасности и санитарно-гигиенические нормы в период боевого дежурства',
            'Беречь имущество подразделения, содержать в чистоте и постоянной готовности закрепленное пожарно-техническое вооружение',
            'Знать обстановку в районе (подрайоне) выезда подразделения',
            'Вносить предложения командиру отделения по улучшению условий несения караульной службы'
          ]
        },
        {
          name: 'Обязанности газодымозащитника',
          body: [
            'Быть в постоянной готовности к ведению действий по тушению пожаров, совершенствовать свою физическую, специальную, медицинскую, психологическую подготовку',
            'Содержать в полной технической исправности СИЗОД и ПТВ, обеспечивать их эксплутацию и техническое обслуживание в установленные сроки',
            'Проходить ежегодное медицинское освидетельствование для определения годности к работе в СИЗОД',
            'Уметь исполнять обязанности Постового на посту безопасности и иметь допуск к ним',
            'Выполнять требования Боевого устава, правил по охране труда и Положения по ГДЗС',
            'Уметь оказывать первую помощь пострадавшим',
            'Совершенствовать навыки работы в составе звена ГДЗС при тушении пожаров и проведении аварийно-спасательных работ в непригодной для дыхания среде',
            'Выполнять распоряжения командира звена, знать задачу звена и выполнять ее',
            'Знать расположение поста безопасности ГДЗС',
            'Соблюдать маршрут движения звена ГДЗС и правила работы в СИЗОД',
            'Не оставлять звено ГДЗС без разрешения командира звена',
            'Следить на маршруте движения за обстановкой и состоянием строительных конструкций',
            'Следить за давлением воздуха в баллоне',
            'Выключаться и включаться в СИЗОД только по команде Командира звена',
            'Докладывать командиру звена об изменении в обстановке, обнаруженных неисправностях в СИЗОД, появлении плохого самочувствия, срабатывании звукового сигнала и действовать по его указаниям',
            'Использовать на баллонах защитные чехлы и оберегать СИЗОД от ударов'
          ]
        },
        {
          name: 'Обязанности постового у фасада',
          body: [
            'Знать и соблюдать порядок допуска личного состава подразделения, граждан и транспортных средств на территорию подразделения',
            'Принимать от граждан заявления о пожарах и авариях и докладывать о них начальнику караула',
            'Вести постоянное наблюдение за обстановкой в пределах видимости, при обнаружении пожара, аварии сообщать начальнику караула',
            'Не допускать остановки и стоянки любых видов транспорта перед воротами гаража и перед въездом на территорию части',
            'Следить за чистотой и порядком у фасада здания подразделения',
            'Выяснять цель прибытия у всех лиц, прибывающих в подразделение, после чего, используя сигнал вызова должностных лиц караула, вызывать начальника караула, а во время его отсутствия – дежурного'
          ]
        },
        {
          name: 'Обязанности постового на посту безопасности',
          body: [
            'Выполнять требования, предусмотренные Боевым уставом, Правилами по охране труда и Положением по ГДЗС',
            'Добросовестно выполнять обязанности, ничем не отвлекаться и не покидать постбез команды должностного лица',
            'Уметь проводить расчеты запаса воздуха и времени работы звена согласно Методике',
            'Вести учет времени работы звена используя рабочий планшет',
            'Рассчитывать перед входом звена ГДЗС в непригодную для дыхания среду общее время работы и ожидаемое время возвращения, сообщить командиру звена',
            'А так же максимальное падение давления, и давление при котором звену ГДЗС необходимо выходить из непригодной для дыхания среды',
            'Промежуток времени с момента включения до подачи команды на возвращениязвена, если очаг пожара не был найден',
            'Занести данные в таблицу рабочего планшета',
            'При получении сведений от командира звена о максимальном падении давления при достижении очага, рассчитать и сообщить ему: контрольное давление, при котором необходимо возвращаться звену и время работы у очага',
            'Поддерживать постоянную связь со звеном ГДЗС, и в случае происшествия докладывать РТП',
            'Не допускать лиц, не входящих в звено ГДЗС в непригодную для дыхания среду',
            'Не допускать скопление людей у входа в непригодную для дыхания среду',
            'Вести наблюдение за обстановкой на пожаре, и если звену угрожает опасность, немедленно информировать РТП и командира звена ГДЗС',
            'Информировать командира звена ГДЗС каждые 10 минут, а при необходимости чаще, о времени прошедшем с момента включения'

          ]
        }
      ]
    }
  }
}
</script>

<style scoped>
p {
  text-align:left;
  line-height: 1.5em;
}
.space {
  white-space: pre-line;
}
h3 {
  padding-top: 1em;
}
</style>
